# Pandas Basic

In [2]:
print('Mohit Janbandhu')

Mohit Janbandhu

- pandas -- Panel Data
- Any data used for research or study purposes
- Objects --> 1 .Series -- 1 Column Multiple rows
              2. Data Frame -- multiple rows and columns
- Built on numpy

In [8]:
import pandas as pd

# Series

In [10]:
ser= pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_1672\2938155832.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser= pd.Series()

In [11]:
type(ser)

pandas.core.series.Series

In [12]:
dtfm= pd.DataFrame()
type(dtfm)

pandas.core.frame.DataFrame

In [13]:
ser

Series([], dtype: float64)

In [14]:
c=pd.Series(17)
c

0    17
dtype: int64

In [15]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [16]:
##  creating series using list
l1=[45,78,56,445,78]
d=pd.Series(l1)
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [39]:
Ser1=pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_1672\1175441265.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  Ser1=pd.Series()

In [40]:
type(Ser1)

pandas.core.series.Series

In [41]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [42]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [44]:
arr2.ndim

2

In [45]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [46]:
b=pd.Series(d)

In [47]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [48]:
d=pd.Series([1,2,3,5,47,58,98,7,8,6,32,78,2,8,289,258,78])
print(d)#,end=" ")

0       1
1       2
2       3
3       5
4      47
5      58
6      98
7       7
8       8
9       6
10     32
11     78
12      2
13      8
14    289
15    258
16     78
dtype: int64

In [49]:
b[2]  # Using default index location

3

In [50]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2,index=['ab','bc','cd'])
s_2

ab    1
bc    2
cd    3
dtype: int32

In [52]:
s_2["ab"]

1

In [53]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [54]:
d[4:9]

4    47
5    98
6     7
7     8
8     6
dtype: int64

In [55]:
d[0:13:3] # Slicing with step

0      1
3      5
6      7
9     32
12     8
dtype: int64

In [56]:
d.head()

0     1
1     2
2     3
3     5
4    47
dtype: int64

In [58]:
d.tail()

11      2
12      8
13    289
14    258
15     78
dtype: int64

In [59]:
d[[7,2,3,5]] ## extracting elements from multiple index

7     8
2     3
3     5
5    98
dtype: int64

In [60]:
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [61]:
d[4]=34  ## changing the element

In [62]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [63]:
d[6:10]=[100,200,300,400]

In [64]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [69]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [77]:
d1=pd.Series(d,index=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,])

In [78]:
d1

0       1.0
1       2.0
2       3.0
3       5.0
4      34.0
5      98.0
6     100.0
7     200.0
8     300.0
9     400.0
10     78.0
11      2.0
12      8.0
13    289.0
14    258.0
15     78.0
16      NaN
dtype: float64

In [80]:
d1.index = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]
d1

1       1.0
2       2.0
3       3.0
4       5.0
5      34.0
6      98.0
7     100.0
8     200.0
9     300.0
10    400.0
11     78.0
12      2.0
13      8.0
14    289.0
15    258.0
16     78.0
17      NaN
dtype: float64

# DataFrame

In [66]:
dtfm=pd.DataFrame()
type(dtfm)

pandas.core.frame.DataFrame

In [68]:
print(dtfm)

Empty DataFrame
Columns: []
Index: []

In [81]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [82]:
print(type(data))

<class 'list'>

In [83]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','5']]

In [84]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', '5']]

In [85]:
d= pd.DataFrame(data)

In [86]:
d

     0     1
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     5

In [90]:
d.index =[1,2,3,4,5] # index name renaming

In [91]:
d

     0     1
1  abc     1
2  def     2
3  ghi     3
4  hij  None
5  klm     5

In [92]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [93]:
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     5

In [94]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [97]:
d= pd.DataFrame(data)  #,columns=['Name','Age'])

In [98]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [101]:
d.rename({'name':'Name','age':"Age"},axis=1,inplace=True)

In [102]:
d

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [103]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [104]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [105]:
d=pd.DataFrame(data, columns=['Name',"Age", "Subject"])

In [106]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [108]:
# Accessing Single Column
d["Name"]

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [109]:
## Accessing multiple column
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [110]:
d[1] ##to access single row

KeyError: 1

In [111]:
d.loc[1]

Name           Bob
Age             12
Subject    Science
Name: 1, dtype: object

In [116]:
d.iloc[2,2]

'Eco'

In [117]:
d.iloc[1,1]

12

In [118]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [121]:
d.loc[[0,1]]  #accessing multiple rows

   Name  Age  Subject
0  ALex   10    Maths
1   Bob   12  Science

In [122]:
# filtering data with perticular rows and column
d.loc[0:2,['Age','Subject']]
# loc takes name of columns as well upper limit

   Age  Subject
0   10    Maths
1   12  Science
2   15      Eco

In [123]:
d.iloc[1:4,[0,2]]    #iloc works only with index of column
# iloc exclude upper limit

    Name  Subject
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo

In [125]:
d.iloc[1,2]

'Science'

In [124]:
d.iloc[3,1]

14

In [126]:
# to access the single element we use iloc 
d.iloc[1,2]

'Science'

In [127]:
d['Gender'] = ['M','M','F','F','F'] # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALex   10    Maths      M
1    Bob   12  Science      M
2  Kelly   15      Eco      F
3  Boris   14      Geo      F
4    Ken   18  English      F

In [128]:
d["Age"]= d["Age"]+2
d

    Name  Age  Subject Gender
0   ALex   12    Maths      M
1    Bob   14  Science      M
2  Kelly   17      Eco      F
3  Boris   16      Geo      F
4    Ken   20  English      F

In [129]:
d['Age']=d['Age']+ 2 # broadcasting

In [130]:
d

    Name  Age  Subject Gender
0   ALex   14    Maths      M
1    Bob   16  Science      M
2  Kelly   19      Eco      F
3  Boris   18      Geo      F
4    Ken   22  English      F

# Data Manipulation

In [3]:
import pandas as pd

In [4]:
data= pd.read_csv('train.csv')

In [6]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Basic Check

In [8]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
data.ndim

2

In [10]:
data.shape

(891, 12)

In [11]:
data.size

10692

In [12]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [16]:
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

# Create new Column

In [19]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [24]:
data.columns.count()

AttributeError: 'Index' object has no attribute 'count'

In [26]:
len(data.columns)

12

In [27]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [31]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
data.isnull().sum() / len(data) * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [32]:
data.isnull().sum()// len(data)*100

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [33]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [35]:
data.counts()

AttributeError: 'DataFrame' object has no attribute 'counts'

In [37]:
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [38]:
data['Family'] = data['SibSp'] + data['Parch']

In [39]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [40]:
len(data.columns)

13

In [41]:
data['Course'] = 'DataScience'

In [42]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Course
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,DataScience
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,DataScience
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,DataScience
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,DataScience
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,DataScience
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,DataScience
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,DataScience
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,DataScience
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,DataScience
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,DataScience

# Remove The columns

In [44]:
data.drop('Course',axis=1)
#axis =1 is used when we are performing operations on column
# axis=0 is used when we are performing operations on rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [45]:
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Course
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,DataScience
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,DataScience

In [46]:
data.drop('Course',axis=1,inplace=True)
# inplace =True will make the changes permenantly in the dataset

In [47]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

# Rename columns

In [6]:
# rename Age-->AGE,Cabin-->CABIN,Fare-->FARE
data.rename(columns={'Age':'AGE','Cabin':'CABIN','Fare':'FARE'},inplace=True)

# Type Casting

# ---------------------------

In [9]:
data.isnull().sum()// len(data)*100

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
AGE            0
SibSp          0
Parch          0
Ticket         0
FARE           0
CABIN          0
Embarked       0
dtype: int64

In [2]:
# Dictionary

dict1={"name":"Mohit", "surename":"Janbandhu","location":"Pune"}

In [3]:
dict1

{'name': 'Mohit', 'surename': 'Janbandhu', 'location': 'Pune'}

In [134]:
for key, value in dict1.items():
    print(key, value)

name Mohit
surename Janbandhu
location Pune

In [19]:
# Dictionary

dict1={"name":"Mohit", "surename":"Janbandhu","location":"Pune"}

In [35]:
for key, value in item(dict1):
    print(key, value)

NameError: name 'item' is not defined

In [24]:
for key, value in dict1.items():
    print(key, value)

name Mohit
surename Janbandhu
location Pune

In [26]:
dict1.keys()

dict_keys(['name', 'surename', 'location'])

In [30]:
dict1.items()

dict_items([('name', 'Mohit'), ('surename', 'Janbandhu'), ('location', 'Pune')])

In [34]:
dict1.values()

dict_values(['Mohit', 'Janbandhu', 'Pune'])

In [36]:
dict1["name"]

'Mohit'

In [37]:
dict1["name"]="Vinod"

In [38]:
dict1

{'name': 'Vinod', 'surename': 'Janbandhu', 'location': 'Pune'}